Repository: MahmoudSherif28/musclemate
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Home
ar: الرئيسية

source: Weight
ar: الوزن

source: Heart Rate
ar: معدل ضربات القلب

source: Meal Plan
ar: خطة الوجبات

source: Schedule
ar: جدول

source: Running
ar: الجري

source: Excercises
ar: تمارين

source: Settings
ar: الإعدادات

source: Support
ar: الدعم

# bhome
source: Home
ar: الرئيسية

# bchat
source: chat
ar: دردشة

# bweight
source: Weight
ar: الوزن

# bsetting
source: Settings
ar: الإعدادات

# fitness
source: Fitness Application
ar: تطبيق اللياقة البدنية

# push
source: Push-Up
ar: ضغط

# leg
source: Leg Extention
ar: تمديد الساق

# day1
source: Training Day1
ar: يوم التدريب 1

# day2
source: Training Day2
ar: يوم التدريب 2

# day3
source: Training Day3
ar: يوم التدريب 3

source: week
ar: الأسبوع

# ex1
source: Excercises1
ar: تمارين 1

# ex2
source: Excercises2
ar: تمارين 2

# ex3
source: Finished
ar: انتهى

# m7
source: 7 minutes
ar: 7 دقائق

# m15
source: 15 minutes
ar: 15 دقيقة

# m5
source: 5 minutes
ar: 5 دقائق

# workout
source: workouts
ar: تمارين

# play
source: Play Video & Timer
ar: تشغيل الفيديو والمؤقت

# pause
source: Pause Video & Timer
ar: إيقاف الفيديو والمؤقت

# weightprogress
source: Your Weight Progress
ar: تقدم وزنك

# addm
source: Add more photos to track your progress
ar: أضف المزيد من الصور لتتبع تقدمك

# selectdata
source: Select Date
ar: اختر تاريخًا

# enterwight
source: Enter your weight
ar: أدخل وزنك

source: Add
ar: إضافة

# rate
source: Rate your Heart Measure
ar: قيم قياس قلبك

# cover
source: cover both the camera and the flah with your finger
ar: قم بتغطية كل من الكاميرا والفلاش بإصبعك

source: Bulking
ar: تضخيم

source: Cutting
ar: تنحيف

source: monday
ar: الاثنين

source: tuesday
ar: الثلاثاء

source: wednesday
ar: الأربعاء

source: thursday
ar: الخميس

source: friday
ar: الجمعة

source: saturday
ar: السبت

source: sunday
ar: الأحد

source: meters
ar: متر

source: Image deleted
ar: تم حذف الصورة

source: Weight entry deleted
ar: تم حذف إدخال الوزن

source: Select Diet Type
ar: اختر نوع النظام الغذائي

source: Select Day
ar: اختر اليوم

source: lenght
ar: الطول

source: km
ar: كم

# min
source: min 50
ar: دقيقة

# max
source: max 150
ar: الحد الأقصى

source: unlock
ar: فتح

# exercisecat
source: Excercise Categories
ar: فئات التمارين

# pushh
source: Push
ar: ضغط

source: Pull
ar: سحب

source: Shoulder
ar: كتف

source: Arm
ar: ذراع

source: Leg
ar: ساق

# pushex
source: Push Excercise
ar: تمرين ضغط

# pullex
source: pull Excercise
ar: تمرين سحب

# shoulderex
source: shoulder Excercise
ar: تمرين كتف

# armex
source: Arm Excercise
ar: تمرين ذراع

# legex
source: Leg Excercise
ar: تمرين ساق

source: Edit Profile
ar: تعديل الملف الشخصي

source: Notifications
ar: الإشعارات

# socailconnect
source: Social Connect
ar: الاتصال الاجتماعي

source: Language
ar: اللغة

source: About App
ar: حول التطبيق

source: contact us
ar: تواصل معنا

source: privacy
ar: الخصوصية

source: Log out
ar: تسجيل الخروج

# save
source: Save Profile
ar: حفظ الملف الشخصي

# get
source: Get in Touch
ar: اتصل بنا

# we
source: We would love to hear from you! Here’s how you can reach us:
ar: يسعدنا سماع رأيك! إليك كيفية التواصل معنا:

# send
source: Send us a message
ar: أرسل لنا رسالة

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Message
ar: رسالة

# Sendmess
source: Send Message
ar: إرسال رسالة

# pri
source: Privacy Policy
ar: سياسة الخصوصية

# effictive
source: Effective Date: January 1, 2024
ar: تاريخ السريان: 1 يناير 2024

source: Introduction
ar: مقدمة

source: Facebook
ar: فيسبوك

source: Twitter
ar: تويتر

source: LinkedIn
ar: لينكد إن

source: tumblr
ar: تمبلر

# max_daily_meters
source: Max daily is {meters} meters
ar: الحد الأقصى اليومي هو {meters} متر

# steps_walked
source: Steps: {steps}
ar: الخطوات: {steps}

source: Your Weight Progress
ar: تقدم وزنك

# add_more_photos
source: Add more photos to track your progress
ar: أضف المزيد من الصور لتتبع تقدمك

source: Select Date
ar: اختر التاريخ

# enter_weight
source: Enter your weight (kg)
ar: أدخل وزنك (كجم)

# add_button
source: Add
ar: إضافة

source: Weight entry deleted
ar: تم حذف إدخال الوزن

source: Image deleted
ar: تم حذف الصورة

# appTitle
source: Rate Your Heart Measure
ar: قم بقياس نبض قلبك

# coverCamera
source: Cover both the camera and the flash with your finger
ar: قم بتغطية كل من الكاميرا والفلاش بإصبعك

# schedule_title
source: Schedule
ar: جدول

# stay_hydrated
source: Stay Hydrated: Drink plenty of water before, during, and after workouts.
ar: ابق رطبًا: اشرب الكثير من الماء قبل التمارين وأثناءها وبعدها.

# incorporate_strength_training
source: Incorporate Strength Training: Aim for at least two sessions per week to build muscle and boost metabolism.
ar: دمج تمارين القوة: استهدف على الأقل جلستين في الأسبوع لبناء العضلات وزيادة الأيض.

# warm_up_cool_down
source: Warm-Up and Cool Down: Always start your workout with a warm-up and end with a cool-down to prevent injuries.
ar: قم بالإحماء والتبريد: ابدأ دائمًا تمرينك بالإحماء وانتهِ بالتبريد لمنع الإصابات.

# get_enough_sleep
source: Get Enough Sleep: Aim for 7-9 hours of quality sleep each night to enhance recovery and performance.
ar: احصل على قسط كافٍ من النوم: استهدف من 7 إلى 9 ساعات من النوم الجيد كل ليلة لتعزيز التعافي والأداء.

# fuel_your_body
source: Fuel Your Body: Consume a balanced diet rich in whole foods, lean proteins, healthy fats, and complex carbohydrates.
ar: زود جسمك: تناول نظامًا غذائيًا متوازنًا غنيًا بالأطعمة الكاملة والبروتينات الخالية من الدهون والدهون الصحية والكربوهيدرات المعقدة.

# set_realistic_goals
source: Set Realistic Goals: Establish achievable short-term and long-term fitness goals to stay motivated.
ar: حدد أهدافًا واقعية: ضع أهداف لياقة بدنية قصيرة وطويلة الأجل قابلة للتحقيق للبقاء متحمسًا.

# mix_up_your_routine
source: Mix Up Your Routine: Incorporate different types of exercises (cardio, strength, flexibility) to avoid boredom and plateaus.
ar: قم بتغيير روتينك: ادخل أنواعًا مختلفة من التمارين (القلب، القوة، المرونة) لتجنب الملل والركود.

# track_your_progress
source: Track Your Progress: Use a journal or app to log workouts and monitor improvements.
ar: تتبع تقدمك: استخدم دفتر ملاحظات أو تطبيق لتسجيل التمارين ومراقبة التحسينات.

# listen_to_your_body
source: Listen to Your Body: Pay attention to your body's signals. If you're feeling fatigued, take a rest day.
ar: استمع إلى جسدك: انتبه لإشارات جسدك. إذا كنت تشعر بالتعب، خذ يوم راحة.

# incorporate_rest_days
source: Incorporate Rest Days: Allow your body to recover by scheduling regular rest days in your routine.
ar: قم بتضمين أيام الراحة: اسمح لجسدك بالتعافي من خلال تحديد أيام راحة منتظمة في روتينك.

# practice_good_form
source: Practice Good Form: Focus on your technique to maximize effectiveness and minimize injury risk.
ar: مارس التقنية الجيدة: ركز على تقنيتك لتعظيم الفعالية وتقليل خطر الإصابة.

# consider_professional_guidance
source: Consider Professional Guidance: Hiring a personal trainer can provide you with tailored workouts and accountability.
ar: فكر في الإرشاد المهني: يمكن أن يوفر لك تعيين مدرب شخصي تمارين مخصصة والمساءلة.

# stay_consistent
source: Stay Consistent: Make fitness a regular part of your routine for long-term benefits.
ar: كن متسقًا: اجعل اللياقة البدنية جزءًا منتظمًا من روتينك للحصول على فوائد طويلة الأجل.

# find_a_workout_buddy
source: Find a Workout Buddy: Exercising with a friend can increase motivation and accountability.
ar: ابحث عن شريك تمارين: يمكن أن يؤدي ممارسة الرياضة مع صديق إلى زيادة التحفيز والمساءلة.

# set_a_schedule
source: Set a Schedule: Plan your workouts in advance and treat them like important appointments.
ar: حدد جدولًا: خطط لتمارينك مسبقًا واعتبرها مواعيد مهمة.

# use_proper_equipment
source: Use Proper Equipment: Invest in good-quality workout gear and equipment to enhance your performance.
ar: استخدم معدات مناسبة: استثمر في معدات وأدوات رياضية عالية الجودة لتعزيز أدائك.

# stretch_regularly
source: Stretch Regularly: Incorporate flexibility exercises to improve range of motion and reduce the risk of injury.
ar: قم بالتمدد بانتظام: أدخل تمارين المرونة لتحسين مدى الحركة وتقليل خطر الإصابة.

# limit_processed_foods
source: Limit Processed Foods: Focus on whole foods and minimize intake of processed snacks and meals.
ar: قلل من الأطعمة المصنعة: ركز على الأطعمة الكاملة وقلل من تناول الوجبات الخفيفة والمأكولات المصنعة.

# incorporate_cardio
source: Incorporate Cardio: Include aerobic exercises for heart health and fat loss, aiming for at least 150 minutes per week.
ar: قم بإدخال تمارين القلب: ادخل تمارين هوائية لصحة القلب وفقدان الدهون، مستهدفًا على الأقل 150 دقيقة في الأسبوع.

# stay_informed
source: Stay Informed: Keep learning about fitness and health through books, podcasts, or courses.
ar: ابق على اطلاع: استمر في التعلم عن اللياقة البدنية والصحة من خلال الكتب والبودكاست أو الدورات.

# eat_before_your_workout
source: Eat Before Your Workout: Have a small snack that combines carbs and protein to fuel your workout.
ar: تناول الطعام قبل التمرين: تناول وجبة خفيفة صغيرة تجمع بين الكربوهيدرات والبروتين لتغذية تمرينك.

# manage_stress
source: Manage Stress: Incorporate mindfulness or relaxation techniques to help manage stress and improve overall well-being.
ar: إدارة التوتر: أدخل تقنيات اليقظة أو الاسترخاء للمساعدة في إدارة التوتر وتحسين الرفاهية العامة.

# avoid_comparing_yourself
source: Avoid Comparing Yourself to Others: Focus on your personal progress rather than comparing yourself to other gym-goers.
ar: تجنب مقارنة نفسك بالآخرين: ركز على تقدمك الشخصي بدلاً من مقارنة نفسك بأشخاص آخرين في صالة الألعاب الرياضية.

# celebrate_small_wins
source: Celebrate Small Wins: Acknowledge and reward yourself for reaching milestones in your fitness journey.
ar: احتفل بالانتصارات الصغيرة: اعترف بجوانب نجاحك واحتفل بها عند الوصول إلى مراحل معينة في رحلتك الرياضية.

# stay_active_outside
source: Stay Active Outside the Gym: Incorporate physical activities into your daily routine, such as walking or biking.
ar: ابق نشطًا خارج صالة الألعاب الرياضية: أدخل الأنشطة البدنية في روتينك اليومي، مثل المشي أو ركوب الدراجات.

# use_a_fitness_tracker
source: Use a Fitness Tracker: Consider using a fitness tracker to monitor your activity levels and set daily goals.
ar: استخدم جهاز تتبع اللياقة البدنية: فكر في استخدام جهاز تتبع اللياقة لمراقبة مستويات نشاطك وتحديد الأهداف اليومية.

# prioritize_nutrition
source: Prioritize Nutrition Around Workouts: Pay special attention to what you eat before and after workouts to optimize performance.
ar: قم بإعطاء الأولوية للتغذية حول التمارين: انتبه بشكل خاص لما تأكله قبل التمارين وبعدها لتحسين الأداء.

# stay_mindful
source: Stay Mindful of Your Mental Health: Exercise is great for mental health; don’t underestimate its positive effects on mood.
ar: ابق متيقظًا لصحتك النفسية: تعتبر التمارين رائعة للصحة النفسية؛ لا تتأثير

# join_group_classes
source: Join Group Classes: Participating in classes can provide structure and a sense of community.
ar: انضم إلى فصول جماعية: يمكن أن توفر المشاركة في الفصول هيكلًا وإحساسًا بالمجتمع.

# adjust_your_plan
source: Adjust Your Plan as Needed: Be flexible with your fitness plan and make adjustments based on your progress and lifestyle changes.
ar: قم بضبط خطتك حسب الحاجة: كن مرنًا مع خطتك الرياضية وأجرِ التعديلات بناءً على تقدمك وتغييرات نمط الحياة.

source: Tips
ar: نصائح

source: Let's Chat
ar: فلنبدأ المحادثة

# describe_image
source: Describe this picture
ar: اوصف الصوره

source: week 1
ar: الأسبوع الأول
